In [10]:
import pandas as pd
import numpy as np
import os

## 멀티인덱스

In [11]:
my_header = ['a','b','c']
my_index_out = ['G1']*3 + ['G2']*3
my_index_out

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [12]:
my_index_in = [1,2,3]*2
my_index_in

[1, 2, 3, 1, 2, 3]

1. zip함수를 사용하여 두 리스트를 합치고 멀티라인 인덱스로 만드세요. my_index

2. 멀티 인덱스 데이터프레임 구성 - 랜덤한 6by3 데이터프레임을 만들고 컬럼이 my_header, 인덱스가 my_index가 되도록 하세요.

3. 가로방향으로 멀티 인덱스를 사용하여 데이터프레임을 구성하세요.

4. G1에 포함된 데이터를 출력하세요.

### groupby

In [13]:
drive_path = r'c:/Apps/temp/data/'
df = pd.read_csv(drive_path + 'data_studentlist_en.csv',header='infer',encoding = 'latin1')
df

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2       Brian Martin      M   24      4       N         B   175.0    80.1
3       David Hassel      M   23      3       N        AB   182.1    85.7
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16      Andrew Daley      M   21      1       N         A   169.2    62.2

1. 남성 키의 평균을 출력하세요.

2. 여성 키의 평균을 출력하세요.

3. 각 성별 키의 평균을 출력하세요.

4. 각 성별 키와 몸무게의 평균을 출력하세요.

5. 각 성별, 혈액형별 키와 몸무게의 평균을 출력하세요.

6. 여성이면서 A형인 사람의 키와 몸무게의 평균을 출력하세요.

7. 시리즈로 성별과 혈액형을 그룹화하고 키의 평균에 대해 출력하세요.

8. 7의 데이터에서 6번의 키의 평균만 출력하세요.

### method

1. df의 height컬럼의 정보를 100으로 나누어 표현하세요.(lambda사용)

2. df데이터를 혈액형, 나이 순으로 정렬하세요. df1에 저장(혈액형은 오름차순, 나이는 내림차순)

3. 2번 데이터를 기존의 인덱스를 지우고 새로 나타내세요. df2에 저장

4. df의 키 데이터를 내림차순 정렬 후 기존의 인덱스를 새로운 인덱스로 나타내세요.

5. df에 존재하는 혈액형의 갯수를 출력하세요.

6. df의 혈액형 중 최빈값을 출력하세요.

### pivot

In [14]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

1. A,B의 값으로 인덱스, C의 값으로 컬럼, 셀에 들어가는 값은 E의 평균으로 출력하세요. dfr

2. 1번의 table에서 결측치를 0으로 채우세요.

3. 2번의 table에서 데이터를 중앙값으로 바꾸세요.

4. A,B의 값으로 인덱스, 셀에 들어가는 값은 D, E의 평균으로 출력하세요.

5. 4번을 groupby로 똑같이 나타내세요.

6. 4번 table에서 D는 평균, E는 중앙값으로 데이터를 출력하세요.